// export const initialComments = [
//   {
//     text: "이 대회는 정말 유익한 경험이었습니다.",
//     timestamp: new Date(Date.now() - 3600000), // 1 hour ago
//     username: "John Doe",
//   },
//   {
//     text: "팀워크를 통해 많은 것을 배웠습니다.",
//     timestamp: new Date(Date.now() - 7200000), // 2 hours ago
//     username: "Jane Smith",
//   },
//   {
//     text: "문제 해결 과정이 정말 인상적이었습니다.",
//     timestamp: new Date(Date.now() - 10800000), // 3 hours ago
//     username: "Alice Johnson",
//   },
// ];

export const mockData = [
  {
    id: 1,
    title: "나의 전역일기",
    content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  },
  {
    id: 2,
    title: "우리의 이야기(1)",
    content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  },
  {
    id: 3,
    title: "우리의 이야기(2)",
    content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  },
  // {
  //   id: 4,
  //   title: "우리의 이야기(3)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 5,
  //   title: "우리의 이야기(4)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 6,
  //   title: "우리의 이야기(5)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 7,
  //   title: "우리의 이야기(6)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 8,
  //   title: "우리의 이야기(7)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 9,
  //   title: "우리의 이야기(8)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 10,
  //   title: "우리의 이야기(8)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 11,
  //   title: "우리의 이야기(8)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
  // {
  //   id: 12,
  //   title: "우리의 이야기(8)",
  //   content: `오늘도 바쁜 하루였다. 아침에 기상 후, 바로 체력 단련을 시작했다. 러닝과 훈련은 여전히 힘들지만, 체력이 조금씩 늘고 있는 게 느껴진다. 오전에는 사격 훈련이 있었는데, 이번엔 목표물을 많이 맞출 수 있어서 기뻤다. 점심 식사 후, 동기들과 함께 청소를 했다. 서로 도와가며 빠르게 끝낼 수 있었다. 오후에는 전술 훈련이 있었는데, 협동심이 중요한 걸 다시 한 번 느꼈다. 훈련이 끝나고 나서야 잠깐의 휴식을 취할 수 있었다. 저녁에는 편지를 받았다. 가족들의 안부와 응원의 말에 큰 힘이 됐다. 오늘 하루도 무사히 끝나서 다행이다. 내일도 최선을 다해야겠다.`,
  // },
];

export const mockData2 = [
  {
    id: 1,
    title: "직업",
    content: "마케팅 매니저",
    isVisibleBriefCard: true,
  },
  {
    id: 2,
    title: "회사",
    content: "ABC 주식회사 (ABC Corp.)",
    isVisibleBriefCard: true,
  },
  {
    id: 3,
    title: "전화",
    content: "010-1234-5678",
    isVisibleBriefCard: true,
  },
  {
    id: 4,
    title: "이메일",
    content: "gil.dong@example.com",
    isVisibleBriefCard: true,
  },
  {
    id: 5,
    title: "주소",
    content: "서울특별시 강남구 테헤란로 ***",
    isVisibleBriefCard: true,
  },
  {
    id: 6,
    title: "웹사이트",
    content: "www.example.com",
    isVisibleBriefCard: true,
  },
];
