export const initialComments = [
  {
    text: "이 대회는 정말 유익한 경험이었습니다.",
    timestamp: new Date(Date.now() - 3600000), // 1 hour ago
    username: "John Doe",
  },
  {
    text: "팀워크를 통해 많은 것을 배웠습니다.",
    timestamp: new Date(Date.now() - 7200000), // 2 hours ago
    username: "Jane Smith",
  },
  {
    text: "문제 해결 과정이 정말 인상적이었습니다.",
    timestamp: new Date(Date.now() - 10800000), // 3 hours ago
    username: "Alice Johnson",
  },
];

export const mockData = {
  id: 1,
  title: "000 항목",
  content: `[대회 이름]에 참가하게 된 동기는 [대회 참여 동기] 때문입니다. 이 대회는 [대회에 대한 설명 및 목표]라는 점에서 저의 관심을 끌었습니다. 특히, [특정 요소]가 저에게 매우 매력적으로 다가왔습니다.
  대회를 준비하면서, 저는 [준비 과정]에 주력했습니다. 처음에는 [어려움]에 부딪혔지만, [문제 해결 방법]을 통해 극복할 수 있었습니다. 팀원들과의 협업도 중요한 부분이었는데, 우리는 [팀워크 경험]을 통해 서로의 강점을 최대한 활용했습니다.
  대회 기간 동안, 저는 [구체적인 활동]을 통해 많은 것을 배웠습니다. 이 대회를 통해 저는 [개인적 부딪혔지만, [문제 해결 방법]을 통해 극복할 수 있었습니다. 팀원들과의 협업도 중요한 부분이었는데, 우리는 [팀워크 경험]을 통해 서로의 강점을 최대한 활용했습니다.
  대회 기간 동안, 저는 [구체적인 활동]을 통해대회 참여 동기] 때문 `,
};
